## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                      |
|--------|-----------------------------------------------|
| update | `aws_security_group.ecs_tasks`                |
| add    | `aws_cloudwatch_log_group.ai_answers_group`   |
|        | `aws_cloudwatch_log_stream.ai_answers_stream` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ update in-place
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_cloudwatch_log_group.ai_answers_group will be created
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_group" "ai_answers_group" {
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn               = (known after apply)
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                = (known after apply)
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_class   = (known after apply)
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name              = "/aws/ecs/ai-answers-cluster"
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix       = (known after apply)
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + retention_in_days = 30
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + skip_destroy      = false
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all          = {
[0;90m20:26:16.007[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "Terraform"  = "true"
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_cloudwatch_log_stream.ai_answers_stream will be created
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_cloudwatch_log_stream" "ai_answers_stream" {
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn            = (known after apply)
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id             = (known after apply)
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + log_group_name = "/aws/ecs/ai-answers-cluster"
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name           = "ai-answers-log-stream"
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.ecs_tasks will be updated in-place
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  ~ resource "aws_security_group" "ecs_tasks" {
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      ~ egress                 = [
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          - {
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - cidr_blocks      = []
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - description      = "Allow ECS to talk to the DocumentDB cluster"
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - from_port        = 27017
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - ipv6_cidr_blocks = []
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - prefix_list_ids  = []
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - protocol         = "tcp"
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - security_groups  = [
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  - "sg-04966047bf236b850",
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m20:26:16.008[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - self             = false
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              - to_port          = 27017
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            # (1 unchanged element hidden)
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        id                     = "sg-085c606383f33733e"
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        name                   = "ai-answers-security-group"
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        tags                   = {
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            "CostCentre" = "ai-answers-staging"
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        # (8 unchanged attributes hidden)
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 2 to add, 1 to change, 0 to destroy.
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m─────────────────────────────────────────────────────────────────────────────
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0mSaved the plan to: plan.tfplan
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTo perform exactly these actions, run the following command to apply:
[0;90m20:26:16.009[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ai_answers_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers.module.sentinel_forwarder[0].aws_ssm_parameter.sentinel_forwarder_auth"]

26 tests, 19 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
